## CMPINF 2100: Homework 05

### Fengyang Han

## Assigned: Tuesday of Week 05 at 11:00PM

## DUE: Tuesday of Week 06 at 11:59PM

## Overview

This assignment is more open ended than the previous ones. You must explore three data sets using the skills you have learned up to this point in the course. The Week 05 lecture material discusses the ESSENTIAL Pandas methods methods that you must ALWAYS use when BEGINNING to explore data. You must use those methods here in this assignment. You must also use SPLIT-APPLY-COMBINE to explore if summary statistics change across grouping variables. The last problem requires you to use the ESSENTIAL Pandas methods to begin exploring data associated with one of the final projects of your choosing.

**You must download the 3 data sets provided in the Canvas assignment page and save them to the appropriate directory on your computer.**

## Required tasks for Problem 01 through 03

For each of the 3 assigned data sets you must perform the following ESSENTIAL activities:

* Display the number of rows and columns in the dataset  
* Display the names of the columns and their associated data types  
* Display the number of unique values for each column  
* Display the number of MISSING values for each column  
* Display summary statistics appropriate for the data type for each column
* Count the number of rows associated with each unique value for:
    * Non-numeric columns  
    * Numeric columns with low number of unique values  

You must also execute SPLIT-APPLY-COMBINE to summarize the data based on grouping variables. Specifically, you must group by non-numeric columns and calculate the following summary statistics:
* Calculate the total number of rows for numeric columns  
* Calculate the number of non missing rows for numeric columns
* Calculate the mean and standard deviation of numeric columns
* Calculate the standard error on the mean of numeric columns
* Calculate the number of unique values for non-numeric columns

You should consider grouping by numeric columns that have low number of unique values.  

For each grouped DataFrame, you must answer the following:  
* Does the average of the numeric variables CHANGE across the groups?  

### Collaborators

Stacey Wang

## Problem 00

You will work with the NumPy and Pandas modules in this assignment.

Import NumPy and Pandas using their commonly accepted aliases.

#### 00) - SOLUTION

In [52]:
###
import numpy as np
import pandas as pd

## Problem 01

Download `hw05_prob_01.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_01.csv` CSV file and assign it to the `df01` object.

Explore the `df01` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 01) - SOLUTION

In [53]:
###
df01 = pd.read_csv('./hw05_prob_01.csv')

In [54]:
## Display number of rows and columns
print("shape:" + str(df01.shape))

shape:(130, 4)

In [55]:
## Display names of the columns and their associated data types
print(df01.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       130 non-null    object
 1   B       130 non-null    object
 2   C       130 non-null    object
 3   x       130 non-null    float64
dtypes: float64(1), object(3)
memory usage: 4.2+ KB
None

In [56]:
## Display the number of unique values for each column 
print(df01.nunique(dropna=False))

A      2
B      2
C      2
x    130
dtype: int64

In [57]:
print(df01.nunique(dropna=True))

A      2
B      2
C      2
x    130
dtype: int64

In [58]:
## Display the number of missing values for each column
print(df01.isna().sum())

A    0
B    0
C    0
x    0
dtype: int64

In [59]:
## Display summary statistics appropriate for the data type for each column
print(df01.describe(include='all'))

          A    B    C           x
count   130  130  130  130.000000
unique    2    2    2         NaN
top      a1   b1   C2         NaN
freq     68   78   72         NaN
mean    NaN  NaN  NaN    2.155995
std     NaN  NaN  NaN    6.015095
min     NaN  NaN  NaN   -7.185043
25%     NaN  NaN  NaN   -0.715064
50%     NaN  NaN  NaN    0.828413
75%     NaN  NaN  NaN    4.375242
max     NaN  NaN  NaN   15.382198

In [60]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df01.A.value_counts(dropna=False)

a1    68
a2    62
Name: A, dtype: int64

In [61]:
df01.B.value_counts(dropna=False)

b1    78
b0    52
Name: B, dtype: int64

In [62]:
df01.C.value_counts(dropna=False)

C2    72
C1    58
Name: C, dtype: int64

In [63]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
## Calculate the number of non missing rows for numberic columns
## Calculate the mean and standard deviation of numeric columns
## Calculate the standard error on the mean of numeric columns
## Calculate the number of unique values for non-numeric columns  

df01.groupby(['A','B','C'],dropna=False).\
aggregate(
            x_size = ('x','size'),
            x_count = ('x','count'),
            x_mean = ('x','mean'),
            x_std = ('x','std'),
            x_sem = ('x','sem')).\
reset_index()

    A   B   C  x_size  x_count     x_mean     x_std     x_sem
0  a1  b0  C1       7        7  -5.497979  0.696923  0.263412
1  a1  b0  C2      22       22  13.542754  0.872442  0.186005
2  a1  b1  C1      25       25  -0.183137  0.654817  0.130963
3  a1  b1  C2      14       14   0.818355  0.687713  0.183799
4  a2  b0  C1      11       11   5.459841  0.571378  0.172277
5  a2  b0  C2      12       12  -0.580973  0.382814  0.110509
6  a2  b1  C1      15       15  -5.899792  0.632946  0.163426
7  a2  b1  C2      24       24   2.056517  0.767123  0.156588

In [64]:
print("It seems confusing, but it works")
df01.groupby(['A','B','C'],dropna=False).\
aggregate(
            A_nunique = ('A','nunique'),
            B_nunique = ('B','nunique'),
            C_nunique = ('C','nunique')).\
reset_index()

It seems confusing, but it works

    A   B   C  A_nunique  B_nunique  C_nunique
0  a1  b0  C1          1          1          1
1  a1  b0  C2          1          1          1
2  a1  b1  C1          1          1          1
3  a1  b1  C2          1          1          1
4  a2  b0  C1          1          1          1
5  a2  b0  C2          1          1          1
6  a2  b1  C1          1          1          1
7  a2  b1  C2          1          1          1

Yes, the average do CHANGE.

## Problem 02

Download `hw05_prob_02.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_02.csv` CSV file and assign it to the `df02` object.

Explore the `df02` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 02) - SOLUTION

In [65]:
###
df02 = pd.read_csv('./hw05_prob_02.csv')

In [66]:
## Display number of rows and columns
print("shape:" + str(df02.shape))

shape:(368, 4)

In [67]:
## Display names of the columns and their associated data types
print(df02.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368 entries, 0 to 367
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       368 non-null    float64
 1   y       352 non-null    float64
 2   A       347 non-null    float64
 3   G       368 non-null    int64
dtypes: float64(3), int64(1)
memory usage: 11.6 KB
None

In [68]:
## Display the number of unique values for each column
print(df02.nunique())

x    368
y    352
A      2
G     14
dtype: int64

In [69]:
## Display the number of missing values for each column
df02.isna().sum()

x     0
y    16
A    21
G     0
dtype: int64

In [70]:
## Display summary statistics appropriate for the data type for each column
print(df02.describe(include='all'))

                x           y           A           G
count  368.000000  352.000000  347.000000  368.000000
mean     0.008874    0.287405    1.608069    6.744565
std      1.017163    1.951770    0.488886    4.121450
min     -2.698471   -7.737557    1.000000    1.000000
25%     -0.696962   -0.599940    1.000000    3.000000
50%     -0.027857    0.188779    2.000000    6.000000
75%      0.607358    1.331244    2.000000   10.000000
max      2.936346    7.875071    2.000000   14.000000

In [71]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df02.A.value_counts(dropna=False)

2.0    211
1.0    136
NaN     21
Name: A, dtype: int64

In [72]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
## Calculate the number of non missing rows for numberic columns
## Calculate the mean and standard deviation of numeric columns
## Calculate the standard error on the mean of numeric columns

df02.groupby(['A'],dropna=False).\
aggregate(
            x_size = ('x','size'),
            y_size = ('y','size'),
            G_size = ('G','size'),

            x_count = ('x','count'),
            y_count = ('y','count'),
            G_count = ('G','count'),

            x_mean = ('x','mean'),
            y_mean = ('y','mean'),
            G_mean = ('G','mean'),

            x_std = ('x','std'),
            y_std = ('y','std'),
            G_std = ('G','std'),

            x_sem = ('x','sem'),
            y_sem = ('y','sem'),
            G_sem = ('G','sem')).\
reset_index()

,A,x_size,y_size,G_size,x_count,y_count,G_count,x_mean,y_mean,G_mean,x_std,y_std,G_std,x_sem,y_sem,G_sem
0,1.0,136,136,136,136,120,136,-0.071118,0.097019,8.573529,1.007348,1.935619,2.671197,0.086379,0.176697,0.229053
1,2.0,211,211,211,211,211,211,0.029215,0.435802,5.028436,1.020511,2.025692,3.871649,0.070255,0.139454,0.266535
2,NaN,21,21,21,21,21,21,0.322540,-0.115713,12.142857,1.024403,0.925330,4.661392,0.223543,0.201923,1.017199

In [73]:
## Calculate the number of unique values for non-numeric columns
## No non-numeric columns

Yes, the average do CHANGE across the groups.

## Problem 03

Download `hw05_prob_03.csv` from the Canvas site. Save the CSV file in the same directory as this Jupyter notebook.

Read in the `hw05_prob_03.csv` CSV file and assign it to the `df03` object.

Explore the `df03` object following **ALL** required actions listed previously.

You must add more code cells and markdown cells to complete this problem.

#### 03) - SOLUTION

In [74]:
df03 = pd.read_csv('./hw05_prob_03.csv')

In [75]:
## Display number of rows and columns
print("shape:" + str(df03.shape))

shape:(1407, 3)

In [76]:
## Display names of the columns and their associated data types
print(df03.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1407 entries, 0 to 1406
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   obs_id  1407 non-null   int64
 1   key     1407 non-null   object
 2   value   1379 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.1+ KB
None

In [77]:
## Display the number of unique values for each column
df03.nunique()

obs_id     201
key          7
value     1379
dtype: int64

In [78]:
## Display the number of missing values for each column
df03.isna().sum()

obs_id     0
key        0
value     28
dtype: int64

In [79]:
## Display summary statistics appropriate for the data type for each column
print(df03.describe(include='all'))

             obs_id   key        value
count   1407.000000  1407  1379.000000
unique          NaN     7          NaN
top             NaN    x1          NaN
freq            NaN   201          NaN
mean     101.000000   NaN    -2.222709
std       58.043614   NaN     4.465882
min        1.000000   NaN   -25.362015
25%       51.000000   NaN    -2.683234
50%      101.000000   NaN    -0.798222
75%      151.000000   NaN     0.250730
max      201.000000   NaN     4.209716

In [80]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df03.key.value_counts(dropna=False)

x1    201
x2    201
x3    201
x4    201
x5    201
x6    201
x7    201
Name: key, dtype: int64

In [83]:
## SPLIT-APPLY-COMBINE Calculate the total number of rows for numeric columns
## Calculate the number of non missing rows for numberic columns
## Calculate the mean and standard deviation of numeric columns
## Calculate the standard error on the mean of numeric columns
## Calculate the number of unique values for non-numeric columns

df03.groupby(['key'],dropna=False).\
aggregate(obs_id_size = ('obs_id','size'),
          value_size = ('value','size'),

            obs_id_count = ('obs_id','count'),
            value_count = ('value','count'),

            obs_id_mean = ('obs_id','mean'),
            value_mean = ('value','mean'),

            obs_id_std = ('obs_id','std'),
            value_std = ('value','std'),

            obs_id_sem = ('obs_id','sem'),
            value_sem = ('value','sem')).\
reset_index()

,key,obs_id_size,value_size,obs_id_count,value_count,obs_id_mean,value_mean,obs_id_std,value_std,obs_id_sem,value_sem
0,x1,101.0,201,201,201,101.0,-0.160787,58.167861,1.735903,4.102845,0.122441
1,x2,101.0,201,201,201,101.0,0.100830,58.167861,0.095558,4.102845,0.006740
2,x3,101.0,201,201,197,101.0,-0.050132,58.167861,1.544633,4.102845,0.110051
3,x4,101.0,201,201,201,101.0,-10.187219,58.167861,5.079706,4.102845,0.358295
4,x5,101.0,201,201,201,101.0,1.061053,58.167861,0.935690,4.102845,0.065998
5,x6,101.0,201,201,197,101.0,-1.463831,58.167861,0.591750,4.102845,0.042160
6,x7,101.0,201,201,181,101.0,-5.085382,58.167861,3.002404,4.102845,0.223167

In [31]:
## Calculate the number of unique values for non-numeric columns
df03.groupby(['key'],dropna=False).\
aggregate(key_nunique = ('key','nunique')).\
reset_index()

  key  key_nunique
0  x1            1
1  x2            1
2  x3            1
3  x4            1
4  x5            1
5  x6            1
6  x7            1

The value column average do CHANGE across the groups.
But, the obs_id column average do NOT CHANGE across the groups.

## Problem 04

You must download the data associated with one of the Final Projects from the Canvas site. Save the file(s) in the same directory as this Jupyter notebook.

Read in the data associated with one of the Final Projects. You must perform the ESSENTIAL activities listed previously.

You do **NOT** need to SPLIT-APPLY-COMBINE to explore across groups for this assignment.

#### 04) - SOLUTION

In [32]:
df_pj = pd.read_csv('./trial_inputs.csv')

In [33]:
## Display number of rows and columns
print("shape:" + str(df_pj.shape))

shape:(240, 7)

In [34]:
## Display names of the columns and their associated data types
print(df_pj.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   trial_id  240 non-null    int64
 1   x1        240 non-null    int64
 2   x2        240 non-null    int64
 3   x3        240 non-null    int64
 4   x4        240 non-null    int64
 5   x5        240 non-null    int64
 6   x6        240 non-null    object
dtypes: int64(6), object(1)
memory usage: 13.2+ KB
None

In [35]:
## Display the number of unique values for each column
df_pj.nunique()

trial_id    240
x1            3
x2            3
x3            2
x4            2
x5            3
x6            4
dtype: int64

In [36]:
## Display the number of missing values for each column
df_pj.isna().sum()

trial_id    0
x1          0
x2          0
x3          0
x4          0
x5          0
x6          0
dtype: int64

In [37]:
## Display summary statistics appropriate for the data type for each column
print(df_pj.describe(include='all'))

         trial_id          x1          x2         x3         x4          x5  \
count   240.00000  240.000000  240.000000  240.00000  240.00000  240.000000
unique        NaN         NaN         NaN        NaN        NaN         NaN
top           NaN         NaN         NaN        NaN        NaN         NaN
freq          NaN         NaN         NaN        NaN        NaN         NaN
mean    120.50000    0.000000    0.000000    0.00000    0.00000    0.000000
std      69.42622    0.731823    0.731823    1.00209    1.00209    0.731823
min       1.00000   -1.000000   -1.000000   -1.00000   -1.00000   -1.000000
25%      60.75000   -1.000000   -1.000000   -1.00000   -1.00000   -1.000000
50%     120.50000    0.000000    0.000000    0.00000    0.00000    0.000000
75%     180.25000    1.000000    1.000000    1.00000    1.00000    1.000000
max     240.00000    1.000000    1.000000    1.00000    1.00000    1.000000

         x6
count   240
unique    4
top       A
freq     60
mean    NaN
std     NaN
min     NaN
25%     NaN
50%     NaN
75%     NaN
max     NaN

In [38]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df_pj.x1.value_counts(dropna=False)

 0    112
-1     64
 1     64
Name: x1, dtype: int64

In [39]:
df_pj.x2.value_counts(dropna=False)

 0    112
-1     64
 1     64
Name: x2, dtype: int64

In [40]:
df_pj.x3.value_counts(dropna=False)

-1    120
 1    120
Name: x3, dtype: int64

In [41]:
df_pj.x4.value_counts(dropna=False)

-1    120
 1    120
Name: x4, dtype: int64

In [42]:
df_pj.x5.value_counts(dropna=False)

 0    112
-1     64
 1     64
Name: x5, dtype: int64

In [43]:
df_pj.x6.value_counts(dropna=False)

A    60
B    60
C    60
D    60
Name: x6, dtype: int64

In [44]:
df_pj_out = pd.read_csv('./trial_outputs.csv')

In [45]:
## Display number of rows and columns
print("shape:" + str(df_pj_out.shape))

shape:(17431, 3)

In [46]:
## Display names of the columns and their associated data types
print(df_pj_out.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17431 entries, 0 to 17430
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   trial_id  17431 non-null  int64
 1   cycle     17431 non-null  int64
 2   y         17431 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 408.7 KB
None

In [47]:
## Display the number of unique values for each column
df_pj_out.nunique()

trial_id      240
cycle         100
y           17431
dtype: int64

In [48]:
## Display the number of missing values for each column
df_pj_out.isna().sum()

trial_id    0
cycle       0
y           0
dtype: int64

In [49]:
## Display summary statistics appropriate for the data type for each column
print(df_pj_out.describe(include='all'))

           trial_id         cycle             y
count  17431.000000  17431.000000  17431.000000
mean     120.738454     43.145086      0.000259
std       67.263248     28.278423      0.000050
min        1.000000      1.000000      0.000161
25%       62.000000     19.000000      0.000224
50%      117.000000     39.000000      0.000260
75%      174.000000     66.000000      0.000298
max      240.000000    100.000000      0.000359

In [50]:
## Count the number of rows associated with each unique value for Non-numberic columns and Numeric columns with low number of unique values
df_pj_out.cycle.value_counts(dropna=False)

1      240
5      240
7      240
6      240
2      240
      ...
96     122
97     119
98     118
99     118
100    118
Name: cycle, Length: 100, dtype: int64